# 포켓몬 정보 데이터

In [209]:
import pandas as pd
import numpy as np 

import warnings 
warnings.filterwarnings('ignore')

데이터 로드

In [210]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/pok/Pokemon.csv')

print(df.shape)
df.head()

(800, 13)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

61. Legendary 컬럼은 전설포켓몬 유무를 나타낸다.전설포켓몬과 그렇지 않은 포켓몬들의 HP평균의 차이를 구하여라

In [211]:
target = df.groupby('Legendary')['HP'].mean()

ans = target.values[1] - target.values[0]
ans

25.55614861329147

62. Type 1은 주속성 Type 2 는 부속성을 나타낸다. 가장 많은 부속성 종류는 무엇인가?

In [212]:
ans = df['Type 2'].value_counts().sort_values(ascending=False).index[0]
ans

'Flying'

63. 가장 많은 Type 1 의 종의 평균 Attack 을 평균 Defense로 나눈값은?

In [213]:
target = df['Type 1'].value_counts().index[0]

ans = df[df['Type 1'] == target]['Attack'].mean() / df[df['Type 1'] == target]['Defense'].mean()
ans

1.0165238678090576

64. 포켓몬 세대(Generation) 중 가장 많은 Legendary를 보유한 세대는 몇세대인가?

In [214]:
ans = df[df['Legendary'] == True]['Generation'].value_counts().index[0]
ans

3

65. 'HP', 'Attack', 'Defense', 'Sp. Atk', 'Sp. Def', 'Speed' 간의 상관 계수 중 가장 절댓값이 큰 두 변수와 그 값을 구하여라

In [215]:
target = df[['HP', 'Attack', 'Defense', 'Sp. Atk', 'Sp. Def', 'Speed']].corr().unstack().reset_index().rename(columns={0 : 'corr'})

target['corr'] = target['corr'].abs()

ans = target[target['corr'] != 1].sort_values(by='corr', ascending=False).iloc[0]
ans

level_0     Sp. Def
level_1     Defense
corr       0.510747
Name: 26, dtype: object

66. 각 Generation의 Attack으로 오름차순 정렬시 상위 3개 데이터들(18개)의 Attack의 전체 평균을 구하여라

In [216]:
ans = df.sort_values(by=['Generation', 'Attack']).groupby(['Generation']).head(3)['Attack'].mean()
ans

19.5

67. 각 Generation의 Attack으로 내림차순 정렬시 상위 5개 데이터들(30개)의 Attack의 전체 평균을 구하여라

In [217]:
ans = df.sort_values(by=['Generation', 'Attack'], ascending=False).groupby(['Generation']).head(5)['Attack'].mean()
ans

157.23333333333332

68. 가장 흔하게 발견되는 (Type1 , Type2) 의 쌍은 무엇인가?

In [218]:
ans = df[['Type 1', 'Type 2']].value_counts().head(1)
ans

Type 1  Type 2
Normal  Flying    24
Name: count, dtype: int64

69. 한번씩만 존재하는 (Type1 , Type2)의 쌍의 갯수는 몇개인가?

In [219]:
target = df[['Type 1', 'Type 2']].value_counts()
target = target[target == 1]

ans = len(target)
ans

39

70. 한번씩만 존재하는 (Type1 , Type2)의 쌍을 각 세대(Generation)은 각각 몇개씩 가지고 있는가?

In [220]:
target = df[['Type 1', 'Type 2']].value_counts()
target = target[target == 1]

lst = []

for value in target.reset_index().values :
    t1 = value[0]
    t2 = value[1]

    m = df[(df['Type 1'] == t1) & (df['Type 2'] == t2)]

    lst.append(m)

ans = pd.concat(lst).reset_index(drop=True)['Generation'].value_counts().sort_index().reset_index()
ans

   Generation  count
0           1      1
1           2      4
2           3      5
3           4     13
4           5      7
5           6      9

# 대한민국 체력장 데이터

데이터 로드

In [221]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/body/body.csv')

print(df.shape)
df.head()

(13396, 12)

,측정나이,측정회원성별,신장 : cm,체중 : kg,체지방율 : %,이완기혈압(최저) : mmHg,수축기혈압(최고) : mmHg,악력D : kg,앉아윗몸앞으로굽히기 : cm,교차윗몸일으키기 : 회,제자리 멀리뛰기 : cm,등급
0,59.0,M,175.0,70.6,19.2,91.0,150.0,40.6,12.2,30.0,179.0,C
1,40.0,F,161.4,45.8,21.7,62.0,119.0,22.1,16.0,32.0,165.0,B
2,27.0,M,176.6,84.8,19.2,87.0,153.0,45.9,13.2,61.0,216.0,B
3,38.0,M,167.6,76.7,24.7,63.0,132.0,43.6,16.0,45.0,231.0,A
4,21.0,M,165.2,66.2,21.5,83.0,106.0,33.5,10.6,46.0,198.0,C

71. 전체데이터의 수축기혈압(최고) - 이완기혈압(최저)의 평균을 구하여라

In [222]:
ans = (df['수축기혈압(최고) : mmHg'] - df['이완기혈압(최저) : mmHg']).mean()
ans

52.19539414750672

72. 50~59세의 신장평균을 구하여라

In [223]:
ans = df[(df['측정나이'] >= 50) & (df['측정나이'] <= 59)]['신장 : cm'].mean()
ans

164.07490107405314

73. 연령대 (20~29 : 20대 ...) 별  인원수를 구하여라

In [224]:
df['연령대'] = df['측정나이'] // 10 * 10

ans = df['연령대'].value_counts()
ans

연령대
20.0    5831
30.0    2660
40.0    1801
50.0    1769
60.0    1335
Name: count, dtype: int64

74. 연령대 (20~29 : 20대 ...) 별 등급의 숫자를 데이터 프레임으로 표현하라

In [225]:
ans = df.groupby(['연령대', '등급'], as_index=False).size().rename(columns={'size' : '개수'})
ans.head()

    연령대 등급    개수
0  20.0  A  1585
1  20.0  B  1443
2  20.0  C  1455
3  20.0  D  1348
4  30.0  A   743

75. 남성 중 A등급과 D등급의 체지방률 평균의 차이(큰 값에서 작은 값의 차)를 구하여라

In [226]:
target = df[df['측정회원성별'] == 'M']

ans = target[target['등급'] == 'D']['체지방율 : %'].mean() - target[target['등급'] == 'A']['체지방율 : %'].mean()
ans

7.932086486137521

76. 여성 중 A등급과 D등급의 체중의 평균의 차이(큰 값에서 작은 값의 차)를 구하여라

In [227]:
target = df[df['측정회원성별'] == 'F']

ans = target[target['등급'] == 'D']['체중 : kg'].mean() - target[target['등급'] == 'A']['체중 : kg'].mean()
ans

5.176211590296504

77. bmi는 자신의 몸무게(kg)를 키의 제곱(m)으로 나눈값이다. 데이터의 bmi 를 구한 새로운 컬럼을 만들고 남성의 bmi 평균을 구하여라

In [228]:
df['bmi'] = df['체중 : kg'] / (df['신장 : cm'] / 100) ** 2

ans = df[df['측정회원성별'] == 'M']['bmi'].mean()
ans

24.46134409819308

78. bmi보다 체지방율이 높은 사람들의 체중평균을 구하여라

In [229]:
ans = df[df['bmi'] < df['체지방율 : %']]['체중 : kg'].mean()
ans

61.7408806392542

79. 남성과 여성의 악력 평균의 차이를 구하여라

In [230]:
target = df.groupby('측정회원성별')['악력D : kg'].mean()

ans = abs(target.values[0] - target.values[1])
ans

17.55954185047465

80. 남성과 여성의 교차윗몸일으키기 횟수의 평균의 차이를 구하여라

In [231]:
target = df.groupby('측정회원성별')['교차윗몸일으키기 : 회'].mean()

ans = abs(target.values[0] - target.values[1])
ans

14.243156833157627

# 기온 강수량 데이터

데이터 로드

In [232]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/weather/weather2.csv")

print(df.shape)
df.head()

(8784, 5)

                  time  이화동강수  이화동기온  수영동강수  수영동기온
0  2020-01-01 00:00:00    0.1   -3.9    0.0    2.5
1  2020-01-01 01:00:00    0.0   -3.1    0.0    3.4
2  2020-01-01 02:00:00    0.0   -1.8    0.0    3.8
3  2020-01-01 03:00:00    0.0   -0.8    0.0    4.6
4  2020-01-01 04:00:00    0.0   -0.1    0.0    5.1

81. 여름철(6월,7월,8월) 이화동이 수영동보다 높은 기온을 가진 시간대는 몇개인가?

In [233]:
df['time'] = pd.to_datetime(df['time'])

summer = df[df['time'].dt.month.isin([6, 7, 8])].reset_index(drop=True)

ans = len(summer[summer['이화동기온'] > summer['수영동기온']])
ans

1415

82. 이화동과 수영동의 최대강수량의 시간대를 각각 구하여라

In [234]:
ans1 = df[df['이화동강수'] == df['이화동강수'].max()]['time'].values
ans2 = df[df['수영동강수'] == df['수영동강수'].max()]['time'].values

print('이화동 최대강수량의 시간대 : ', ans1)
print('수영동 최대강수량의 시간대 : ', ans2)

이화동 최대강수량의 시간대 :  ['2020-09-30T09:00:00.000000000']
수영동 최대강수량의 시간대 :  ['2020-07-23T12:00:00.000000000']

# 서비스 이탈 예측 데이터

데이터 로드

In [235]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/churn/train.csv")

print(df.shape)
df.head()

(7999, 14)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,6842,15793491,Cherkasova,714,Germany,Male,26,3,119545.48,2,1,0,65482.94,0
1,8963,15607874,Keane,687,France,Male,38,0,144450.58,1,0,1,137276.83,0
2,7047,15737627,Rivero,589,Germany,Female,20,2,121093.29,2,1,0,3529.72,0
3,7503,15697844,Whitehouse,721,Spain,Female,32,10,0.00,1,1,0,136119.96,1
4,3439,15722404,Carpenter,445,France,Female,30,3,0.00,2,1,1,127939.19,0

83. 남성 이탈(Exited)이 가장 많은 국가(Geography)는 어디이고 이탈 인원은 몇명인가?

In [236]:
ans = df[df['Gender'] == 'Male'].groupby('Geography')['Exited'].sum().sort_values(ascending=False).head(1)
ans

Geography
Germany    287
Name: Exited, dtype: int64

84. 카드를 소유(HasCrCard ==1)하고 있으면서 활성멤버(IsActiveMember ==1) 인 고객들의 평균 나이를 소숫점이하 4자리까지 구하여라?

In [237]:
ans = df[(df['HasCrCard'] == 1) & (df['IsActiveMember'] == 1)]['Age'].mean().round(4)
ans

39.6102

85. Balance 값이 중간값 이상을 가지는 고객들의 CreditScore의 표준편차를 소숫점이하 3자리까지 구하여라

In [238]:
ans = df[df['Balance'] >= df['Balance'].median()]['CreditScore'].std()
ans = round(ans, 3)
ans

97.295

# 성인 건강검진 데이터

데이터 로드

In [239]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/smoke/train.csv")

print(df.shape)
df.head()

(44553, 26)

,성별코드,연령대코드(5세단위),신장(5Cm단위),체중(5Kg단위),허리둘레,시력(좌),시력(우),청력(좌),청력(우),수축기혈압,...,혈색소,요단백,혈청크레아티닌,(혈청지오티)AST,(혈청지오티)ALT,감마지티피,흡연상태,구강검진수검여부,치아우식증유무,치석
0,F,55,145,55,73.0,0.7,0.5,1.0,1.0,129.0,...,12.9,1.0,0.9,172.0,209.0,15.0,0,Y,0.0,Y
1,M,40,180,55,74.0,1.5,1.5,1.0,1.0,102.0,...,15.6,1.0,0.8,30.0,19.0,23.0,1,Y,0.0,Y
2,F,55,150,50,72.0,1.0,0.2,1.0,1.0,116.0,...,14.1,1.0,1.0,31.0,19.0,10.0,0,Y,0.0,N
3,M,40,170,85,89.0,1.0,0.8,1.0,1.0,124.0,...,16.7,1.0,1.0,26.0,38.0,108.0,1,Y,1.0,Y
4,F,40,155,45,62.0,0.5,1.0,1.0,1.0,127.0,...,12.9,1.0,0.7,20.0,11.0,13.0,0,Y,0.0,N

86. 수축기혈압과 이완기 혈압기 수치의 차이를 새로운 컬럼('혈압차') 으로 생성하고, 연령대 코드별 각 그룹 중 '혈압차' 의 분산이 5번째로 큰 연령대 코드를 구하여라

In [240]:
df['혈압차'] = df['수축기혈압'] - df['이완기혈압']

ans = df.groupby('연령대코드(5세단위)')['혈압차'].var().sort_values().index[-5]
ans

60

87. 비만도를 나타내는 지표인 WHtR는 허리둘레 / 키로 표현한다. 일반적으로 0.58이상이면 비만으로 분류한다. 데이터중 WHtR 지표상 비만인 인원의 남/여 비율을 구하여라

In [241]:
df['WHtR'] = df['허리둘레'] / df['신장(5Cm단위)']

target = df[df['WHtR'] >= 0.58].groupby('성별코드').size()

ans = target / len(df[df['WHtR'] >= 0.58])
ans

성별코드
F    0.46096
M    0.53904
dtype: float64

# 자동차 보험가입 예측데이터

데이터 로드

In [242]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/insurance/train.csv")

print(df.shape)
df.head()

(304887, 12)

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,188957,Female,25,1,17.0,1,< 1 Year,No,38785.0,152.0,59,0
1,275631,Male,20,1,22.0,0,< 1 Year,No,2630.0,160.0,113,0
2,329036,Female,40,1,41.0,0,1-2 Year,Yes,33165.0,124.0,188,0
3,227288,Female,28,1,30.0,1,< 1 Year,No,29038.0,152.0,233,0
4,300441,Female,50,1,28.0,0,1-2 Year,Yes,31325.0,124.0,258,0

88. Vehicle_Age 값이 2년 이상인 사람들만 필터링 하고 그중에서 Annual_Premium 값이 전체 데이터의 중간값 이상인 사람들을 찾고, 그들의 Vintage값의 평균을 구하여라

In [243]:
ans = df[(df['Vehicle_Age'] == '> 2 Years') & (df['Annual_Premium'] >= df['Annual_Premium'].median())]['Vintage'].mean()
ans

154.43647182359118

89. vehicle_age에 따른 각 성별(gender)그룹의 
Annual_Premium값의 평균을 구하여 아래 테이블과 동일하게 구현하라

In [244]:
target = df.groupby(['Vehicle_Age', 'Gender'], as_index=False)['Annual_Premium'].mean()

ans = target.pivot(index='Vehicle_Age', columns='Gender', values='Annual_Premium')
ans

Gender             Female          Male
Vehicle_Age
1-2 Year     30762.245001  30413.088469
< 1 Year     29972.286702  30310.982212
> 2 Years    36108.366374  35303.870627

# 핸드폰 가격 예측데이터

데이터 로드

In [245]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/mobile/train.csv")

print(df.shape)
df.head()

(2000, 21)

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1

90. price_range 의 각 value를 그룹핑하여 각 그룹의 n_cores 의 빈도가 가장높은 value와 그 빈도수를 구하여라

In [246]:
target = df[['price_range', 'n_cores']].groupby(['price_range', 'n_cores']).size().to_frame().rename(columns={0 : 'count'})

ans = target.sort_values(by=['price_range', 'count'], ascending=False).groupby('price_range').head(1)
ans

                     count
price_range n_cores
3           5           70
2           4           73
1           1           76
0           2           69

91. price_range 값이 3인 그룹에서 상관관계가 2번째로 높은 두 컬럼과 그 상관계수를 구하여라

In [247]:
target = df[df['price_range'] == 3].corr().unstack().sort_values(ascending=False)

ans = target[target != 1].reset_index().iloc[1]
ans

level_0          pc
level_1          fc
0          0.635166
Name: 1, dtype: object